## tofu plan l4_data/fini-logs-search

with opensearch index management

```terraform

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # digitalocean_database_cluster.logs_search will be created
  + resource "digitalocean_database_cluster" "logs_search" {
      + database             = (known after apply)
      + engine               = "opensearch"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + metrics_endpoints    = (known after apply)
      + name                 = "fini-logs-search"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + project_id           = (known after apply)
      + region               = "nyc3"
      + size                 = "db-s-1vcpu-2gb"
      + storage_size_mib     = (known after apply)
      + tags                 = [
          + "environment:prod",
          + "layer:l4-data",
          + "purpose:log-analytics",
        ]
      + ui_database          = (known after apply)
      + ui_host              = (known after apply)
      + ui_password          = (sensitive value)
      + ui_port              = (known after apply)
      + ui_uri               = (sensitive value)
      + ui_user              = (known after apply)
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "2"
    }

  # digitalocean_database_user.logs_ingest will be created
  + resource "digitalocean_database_user" "logs_ingest" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      + cluster_id  = (known after apply)
      + id          = (known after apply)
      + name        = "logs-ingest"
      + password    = (sensitive value)
      + role        = (known after apply)
    }

  # opensearch_index.app_logs_initial will be created
  + resource "opensearch_index" "app_logs_initial" {
      + aliases            = jsonencode(
            {
              + app-logs = {
                  + is_write_index = true
                }
            }
        )
      + force_destroy      = true
      + id                 = (known after apply)
      + name               = "app-logs-000001"
      + number_of_replicas = (known after apply)
      + number_of_shards   = (known after apply)
      + rollover_alias     = (known after apply)
    }

  # opensearch_index_template.app_logs_template will be created
  + resource "opensearch_index_template" "app_logs_template" {
      + body = jsonencode(
            {
              + index_patterns = [
                  + "app-logs-*",
                ]
              + template       = {
                  + mappings = {
                      + properties = {
                          + "@timestamp" = {
                              + type = "date"
                            }
                          + app_name     = {
                              + type = "keyword"
                            }
                          + duration_ms  = {
                              + type = "long"
                            }
                          + environment  = {
                              + type = "keyword"
                            }
                          + host         = {
                              + type = "keyword"
                            }
                          + level        = {
                              + type = "keyword"
                            }
                          + message      = {
                              + fields = {
                                  + keyword = {
                                      + ignore_above = 256
                                      + type         = "keyword"
                                    }
                                }
                              + type   = "text"
                            }
                          + method       = {
                              + type = "keyword"
                            }
                          + path         = {
                              + type = "keyword"
                            }
                          + request_id   = {
                              + type = "keyword"
                            }
                          + status_code  = {
                              + type = "integer"
                            }
                        }
                    }
                  + settings = {
                      + "index.refresh_interval"                        = "30s"
                      + number_of_replicas                              = 0
                      + number_of_shards                                = 1
                      + "plugins.index_state_management.policy_id"      = "app-logs-retention-policy"
                      + "plugins.index_state_management.rollover_alias" = "app-logs"
                    }
                }
            }
        )
      + id   = (known after apply)
      + name = "app-logs-template"
    }

  # opensearch_ism_policy.app_logs_policy will be created
  + resource "opensearch_ism_policy" "app_logs_policy" {
      + body         = jsonencode(
            {
              + policy = {
                  + default_state = "active"
                  + description   = "Manage application log indices with rollover and retention"
                  + states        = [
                      + {
                          + actions     = [
                              + {
                                  + rollover = {
                                      + min_index_age          = "7d"
                                      + min_primary_shard_size = "10gb"
                                    }
                                },
                            ]
                          + name        = "active"
                          + transitions = [
                              + {
                                  + conditions = {
                                      + min_index_age = "7d"
                                    }
                                  + state_name = "warm"
                                },
                            ]
                        },
                      + {
                          + actions     = [
                              + {
                                  + replica_count = {
                                      + number_of_replicas = 0
                                    }
                                },
                            ]
                          + name        = "warm"
                          + transitions = [
                              + {
                                  + conditions = {
                                      + min_index_age = "30d"
                                    }
                                  + state_name = "delete"
                                },
                            ]
                        },
                      + {
                          + actions     = [
                              + {
                                  + delete = {}
                                },
                            ]
                          + name        = "delete"
                          + transitions = []
                        },
                    ]
                }
            }
        )
      + id           = (known after apply)
      + policy_id    = "app-logs-retention-policy"
      + primary_term = (known after apply)
      + seq_no       = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_platform_endpoint = (known after apply)
  + app_platform_index    = "app-logs"
  + cluster_host          = (known after apply)
  + cluster_id            = (known after apply)
  + cluster_port          = (known after apply)
  + cluster_private_uri   = (sensitive value)
  + cluster_uri           = (sensitive value)
  + cluster_urn           = (known after apply)
  + database_name         = (known after apply)
  + ingest_user           = "logs-ingest"
  + ingest_user_password  = (sensitive value)
  + ism_policy_id         = "app-logs-retention-policy"
  + log_index_alias       = "app-logs"
  + log_retention_days    = 30
```
